/* Copyright 2017 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

var zawygi_unicode_convert_data = [
{
    z: " ",
    u: " "
},
{
    z: "123",
    u: "123"
},
{
    z: "abc",
    u: "abc"
},
{
    z: ".!@",
    u: ".!@"
},
{
    z: "\u1021\u102C\u100F\u102C\u1015\u102D\u102F\u1004\u1039\u1031" +               "\u1010\u103C",
    u: "\u1021\u102C\u100F\u102C\u1015\u102D\u102F\u1004\u103A\u1010" +
    "\u103D\u1031"
},
{
    z: "\u1018\u101A\u1039\u1031\u101C\u102C\u1000\u1039\u1010\u102C" +
    "\u1038\u1010\u102C\u1038 ",
    u: "\u1018\u101A\u103A\u101C\u1031\u102C\u1000\u103A\u1010\u102C" +
    "\u1038\u1010\u102C\u1038 "
},
{
    z: "\u1011\u102D\u102F\u1004\u1039\u1038\u1000\u102D\u102F",
    u: "\u1011\u102D\u102F\u1004\u103A\u1038\u1000\u102D\u102F"
},
{
    z: "\u108F\u102D\u102F\u1004\u1039\u107F\u1015\u102E\u1038",
    u: "\u1014\u102D\u102F\u1004\u103A\u1015\u103C\u102E\u1038"
},
{
    z: "\u1031\u103B\u1001\u1010\u101C\u103D\u1019\u1039\u1038\u1010" +
    "\u102D\u102F\u1038\u101C\u102D\u102F\u1000\u1039\u1010\u1032" +
    "\u1037",

    u: "\u1001\u103C\u1031\u1010\u101C\u103E\u1019\u103A\u1038\u1010" +
    "\u102D\u102F\u1038\u101C\u102D\u102F\u1000\u103A\u1010\u1032" +
    "\u1037"
},
{
    z: "\u103B\u1019\u1014\u1039\u1019\u102C ",

    u: "\u1019\u103C\u1014\u103A\u1019\u102C "
},
{
    z: "\u1021\u1019\u103A\u102D\u1033\u1038\u101E\u1019\u102E\u1038",

    u: "\u1021\u1019\u103B\u102D\u102F\u1038\u101E\u1019\u102E\u1038"
},
{
    z: "\u1031\u1018\u102C\u101C\u1036\u102F\u1038\u1021\u101E\u1004" +
    "\u1039\u1038",

    u: "\u1018\u1031\u102C\u101C\u102F\u1036\u1038\u1021\u101E\u1004" +
    "\u103A\u1038"
},
{
    z: "\u1031\u1006\u102C\u1004\u1039\u1038\u1025\u102E\u1038\u101C" +
    "\u1004\u1039\u1038",

    u: "\u1006\u1031\u102C\u1004\u103A\u1038\u1026\u1038\u101C" +
    "\u1004\u103A\u1038"
},
{
    z: "\u103B\u1019\u1014\u1039\u1019\u102C\u1021\u101E\u1004\u1039" +
    "\u1038\u101F\u102C",

    u: "\u1019\u103C\u1014\u103A\u1019\u102C\u1021\u101E\u1004\u103A" +
    "\u1038\u101F\u102C"
},
{
    z: "\u1021\u102C\u1006\u102E\u101A\u1036\u1031\u1012\u101E\u1010" +
    "\u103C\u1004\u1039\u1038\u1019\u103D ",

    u: "\u1021\u102C\u1006\u102E\u101A\u1036\u1012\u1031\u101E\u1010" +
    "\u103D\u1004\u103A\u1038\u1019\u103E "
},
{
    z: " \u1010\u101E\u1004\u1039\u1038\u1010\u100A\u1039\u1038" +
    "\u1031\u101E\u102C ",

    u: " \u1010\u101E\u1004\u103A\u1038\u1010\u100A\u103A\u1038" +
    "\u101E\u1031\u102C "
},
{

    z: " \u1021\u101E\u1004\u1039\u1038\u1021\u103B\u1016\u1005\u1039 ",

    u: " \u1021\u101E\u1004\u103A\u1038\u1021\u1016\u103C\u1005\u103A "
},
{
    z: "\u103B\u1019\u1014\u1039\u1019\u102C\u1037\u108F\u102D\u102F" +
    "\u1004\u1039\u1004\u1036\u1031\u101B\u1038\u1019\u103D\u102C",

    u: "\u1019\u103C\u1014\u103A\u1019\u102C\u1037\u1014\u102D\u102F" +
    "\u1004\u103A\u1004\u1036\u101B\u1031\u1038\u1019\u103E\u102C"
},
{
    z: "\u1005\u1005\u1039\u1010\u1015\u1039\u1015\u102B\u101D\u1004" +
    "\u1039\u107F\u1015\u102E\u1038",

    u: "\u1005\u1005\u103A\u1010\u1015\u103A\u1015\u102B\u101D\u1004" +
    "\u103A\u1015\u103C\u102E\u1038"
},
{
    z: "\u1006\u102D\u102F\u101B\u1004\u1039",

    u: "\u1006\u102D\u102F\u101B\u1004\u103A"
},
{
    z: "\u103B\u1015\u1033\u103B\u1015\u1004\u1039\u1031\u103B\u1015" +
    "\u102C\u1004\u1039\u1038\u101C\u1032\u1031\u101B\u1038\u1031" +
    "\u1016\u102C\u1039\u1031\u1006\u102C\u1004\u1039\u1031\u1014" +
    "\u1010\u1032\u1037",

    u: "\u1015\u103C\u102F\u1015\u103C\u1004\u103A\u1015\u103C\u1031" +
    "\u102C\u1004\u103A\u1038\u101C\u1032\u101B\u1031\u1038\u1016" +
    "\u1031\u102C\u103A\u1006\u1031\u102C\u1004\u103A\u1014\u1031" +
    "\u1010\u1032\u1037"
},
{
    z: "\u1015\u100A\u102C\u1031\u101B\u1038\u1031\u1015\u105A\u101C" +
    "\u1005\u102E\u1006\u102D\u102F\u102F\u1004\u1039\u101B\u102C",

    u: "\u1015\u100A\u102C\u101B\u1031\u1038\u1015\u1031\u102B\u103A" +
    "\u101C\u1005\u102E\u1006\u102D\u102F\u1004\u103A\u101B\u102C"
},
{
    z: "\u101C\u1030\u101B\u103D\u1004\u1039\u101E\u1001\u103A\u1064" +
    "\u1033\u102D\u1004\u1039\u1038\u1019\u103A\u102C\u1038\u1021" +
    "\u1031\u107E\u1000\u102C\u1004\u1039\u1038",

    u: "\u101C\u1030\u101B\u103E\u1004\u103A\u101E\u1004\u103A\u1039" +
    "\u1001\u103B\u102D\u102F\u1004\u103A\u1038\u1019\u103B\u102C" +
    "\u1038\u1021\u1000\u103C\u1031\u102C\u1004\u103A\u1038"
},
{
    z: "\u1001\u102F\u102F\u108F\u103D\u1005\u1039\u1021\u1010\u103C" +
    "\u1000\u1039",

    u: "\u1001\u102F\u1014\u103E\u1005\u103A\u1021\u1010\u103D\u1000" +
    "\u103A"
},
{
    z: "\u1010\u1036\u1006\u102D\u1015\u1039\u1021\u1000\u103A\u108C" +
    "\u1031\u1010\u103C\u1031\u101B\u102C\u1004\u1039\u1038\u1001" +
    "\u103A\u103B\u1016\u1005\u1039\u1001\u1032\u1037\u1010\u1032" +
    "\u1037",

    u: "\u1010\u1036\u1006\u102D\u1015\u103A\u1021\u1004\u103A\u1039" +
    "\u1000\u103B\u102E\u1010\u103D\u1031\u101B\u1031\u102C\u1004" +
    "\u103A\u1038\u1001\u103B\u1016\u103C\u1005\u103A\u1001\u1032" +
    "\u1037\u1010\u1032\u1037"
},
{
    z: "\u101C\u1036\u102F\u101C\u1036\u102F\u107F\u1001\u1036\u1033" +
    "\u107F\u1001\u1036\u1033",

    u: "\u101C\u102F\u1036\u101C\u102F\u1036\u1001\u103C\u102F\u1036" +
    "\u1001\u103C\u102F\u1036"
},
{
    z: "\u1005\u1005\u1039\u1021\u102F\u102F\u1015\u1039\u1001\u103A" +
    "\u1033\u1015\u1039\u1019\u1088",

    u: "\u1005\u1005\u103A\u1021\u102F\u1015\u103A\u1001\u103B\u102F" +
    "\u1015\u103A\u1019\u103E\u102F"
},
{
    z: "\u1031\u1021\u102C\u1039\u1018\u102F\u1014\u1039\u1038\u107E" +
    "\u1000\u102E\u1038\u1019\u102E\u1038\u103B\u1019\u102D\u103D" +
    "\u1000\u1039\u103B\u1015\u102E\u1038\u1019\u103D\u1000\u1014" +
    "\u1039\u1031\u1010\u102C\u1037\u1010\u1032\u1037\u101C\u102C" +
    "\u1038",

    u: "\u1021\u1031\u102C\u103A\u1018\u102F\u1014\u103A\u1038\u1000" +
    "\u103C\u102E\u1038\u1019\u102E\u1038\u1019\u103C\u103E\u102D" +
    "\u1000\u103A\u1015\u103C\u102E\u1038\u1019\u103E\u1000\u1014" +
    "\u103A\u1010\u1031\u102C\u1037\u1010\u1032\u1037\u101C\u102C" +
    "\u1038"
},
{
    z: "\u1016\u102D\u102F\u102F\u101B\u1019\u1039",

    u: "\u1016\u102D\u102F\u101B\u1019\u103A"
},
{
    z: "\u1004\u1037\u1039",

    u: "\u1004\u1037\u103A"
},
{
    z: "\u1006\u1000\u1039\u1000\u103A\u1004\u1039\u1037\u101E\u1036" +
    "\u102F\u1038\u1019\u101A\u1039",

    u: "\u1006\u1000\u103A\u1000\u103B\u1004\u1037\u103A\u101E\u102F" +
    "\u1036\u1038\u1019\u101A\u103A"
},
{
    z: "\u1010\u1000\u1039\u1040\u1004\u1039\u1031\u101B\u102C",

    u: "\u1010\u1000\u103A\u101D\u1004\u103A\u101B\u1031\u102C"
},
{
    z: "\u1031\u1014\u0020\u1037\u1005\u1025\u1039",

    u: "\u1014\u1031\u1037\u1005\u1009\u103A"
},
{
    z: "\u1000\u1019\u107B\u102C\u1037\u1031\u1005\u103A\u1038\u1021",

    u: "\u1000\u1019\u1039\u1018\u102C\u1037\u1008\u1031\u1038\u1021"
},
{
    z: "\u1019\u103D\u1088\u1001\u1004\u1039",

    u: "\u1019\u103E\u102F\u1001\u1004\u103A"
},
{
    z: "\u1000\u0020\u102b\u0020\u1031\u1001",

    u: "\u1000\u102b\u0020\u1001\u1031"
},
{
    z: "\u1000\u200b\u102b\u0020\u1031\u1001",

    u: "\u1000\u102b\u0020\u1001\u1031"
},
{
    z: "\u1000\u2060\u102b\u0020\u1031\u1001",

    u: "\u1000\u102b\u0020\u1001\u1031"
},
{
    z: "\u1000\ufeff\u102b\u0020\u1031\u1001",

    u: "\u1000\u102b\u0020\u1001\u1031"
},
{
    z: "\u1000\u0020\u0020\u102b\u0020\u1031\u1001",

    u: "\u1000\u102b\u0020\u1001\u1031"
},
{
    z: "\u1000\u0020\u200c\u200d\u200b\u2060\ufeff" +
    "\u102b\u0020\u1031\u1001",

    u: "\u1000\u102b\u0020\u1001\u1031"
},
{
    z: "\u1000\u0020\u103a\u0020\u1031\u1001",

    u: "\u1000\u103B\u0020\u1001\u1031"
},
{
    z: "\u1000\u200b\u103a\u0020\u1031\u1001",

    u: "\u1000\u103B\u0020\u1001\u1031"
},
{
    z: "\u1000\u2060\u103a\u0020\u1031\u1001",

    u: "\u1000\u103B\u0020\u1001\u1031"
},
{
    z: "\u1000\ufeff\u103a\u0020\u1031\u1001",

    u: "\u1000\u103B\u0020\u1001\u1031"
},
{
    z: "\u1000\u103b\u103a\u0020\u1031\u1001\u102c",

    u: "\u1000\u103b\u103c\u0020\u1001\u1031\u102c"
},
{
    z: "\u1000\u103b\u107d\u0020\u1031\u1001",

    u: "\u1000\u103b\u103c\u0020\u1001\u1031"
},
{
    z: "\u1000\u0020\u103b\u103a\u0020\u1031\u1001",

    u: "\u1000\u103b\u103c\u0020\u1001\u1031"
},
{
    z: "\u1000\u0020\u103b\u0020\u103a\u0020\u1031\u1001",

    u: "\u1000\u103b\u103c\u0020\u1001\u1031"
},
{
    z: "\u1000\u200b\u103a\u2060\u103d\u0020\u1031\u1001",

    u: "\u1000\u103b\u103e\u0020\u1001\u1031"
},
{
    z: "\u1000\u103b\u0020\u103a\u0020\u1031\u1001",

    u: "\u1000\u103b\u103c\u0020\u1001\u1031"
},
{
    z: "\u1000\u200b\u103a\u0020\u103b\u0020\u1031\u1001",

    u: "\u1000\u103b\u103c\u0020\u1001\u1031"
},
{
    z: "\u1000\u0020\u1073\u0020\u1031\u1001",

    u: "\u1000\u1039\u1011\u0020\u1001\u1031"
},
{
    z: "\u1000\u0020\u1074\u0020\u1031\u1001",

    u: "\u1000\u1039\u1011\u0020\u1001\u1031"
},
{
    z: "ႁခြင္းခ်က﻿္မရွိ",
    u: "ခြွင်းချက်မရှိ"
},
{
    z: "ႁခ ⁠ ြင္းခ်က ​္မ ၍",
    u: "ခြွင်းချက်မ ၍"
},
{
    z: "ႁခြင္းခ်က​္မရွိ",
    u: "ခြွင်းချက်မရှိ"
},
{
    z: "ႁခြင္းခ်က⁠္မရွိ",
    u: "ခြွင်းချက်မရှိ"
},
{
    z: "ႁခြင္းခ်က‌္မရွိ",
    u: "ခြွင်းချက်မရှိ"
},
{
    z: "ႁခြင္းခ်က‍္မရွိ",
    u: "ခြွင်းချက်မရှိ"
},
{
    z: "ခ ါဘယ်",
    u: "ခါဘယျ"
},
{
    z: "ခ ူဘယ်",
    u: "ခူဘယျ"
},
{
    z: "ခ ေဘယ်",
    u: "ခ ဘေယျ"
},
{
    z: "ခ⁠ဲဘယ်",
    u: "ခဲဘယျ"
},
{
    z: "ခ⁠ဲဘယ်",
    u: "ခဲဘယျ"
},
{
    z: "ခ‍ှဘယ်",
    u: "ခှဘယျ"
},
{
    z: "ဃ ၠဃၠဃ ႓ဃ‍႓ဃ⁠႔",
    u: "ဃ္ကဃ္ကဃ္ဘဃ္ဘဃ့"
},
{
    z: "\u1001\u0020\u1031\u1018\u101a\u1039",

    u: "ခ ဘေယ်"
},
{
    z: "၁၉၄၈ ခုႏွစ္​၊ ဒီဇင္​သာလ ၁၀ ရက္​​ေန႔တြင္​ ကဓၻာ့ကုလသမဂအဖဲြ႔ " +
    "အတည္​ျပဳ၍ ​ေၾကညာလိုက္​ရာ",

    u: "၁၉၄၈ ခုနှစ်​၊ ဒီဇင်​သာလ ၁၀ ရက်​​နေ့တွင်​ ကဓ္ဘာ့ကုလသမဂအဖွဲ့ " +
    "အတည်​ပြု၍ ​ကြေညာလိုက်​ရာ"
},
{
    z: "၁၉၄၈ ခုႏွစ​္၊ ဒီဇင​္သာလ ၁၀ ရက​္ေန႔တ​ြင္ ကဓၻာ​့ကုလသမဂအဖဲြ႔",

    u: "၁၉၄၈ ခုနှစ်၊ ဒီဇင်သာလ ၁၀ ရက်နေ့တွင် ကဓ္ဘာ့ကုလသမဂအဖွဲ့"
},
{
    z: "\u103b\u103b\u1000",

    u: "\u1000\u103c"
},
{
    z: "\u103b\u103b\u107e\u1000",

    u: "\u1000\u103c"
},
{
    z: "\u107f\u1084\u1082\u1000",

    u: "\u1000\u103c"
},
{
    z: "\u103b\u107f\u1080\u1083\u1084\u1081\u1082\u1000",

    u: "\u1000\u103c"
},
{
    z: "\u1000\u102d\u102d",

    u: "\u1000\u102d"
},
{
    z: "\u1001\u102e\u102e",

    u: "\u1001\u102e"
},
{
    z: "\u1002\u102f\u102f",

    u: "\u1002\u102f"
},
{
    z: "\u1003\u1030\u1030",

    u: "\u1003\u1030"
},
{
    z: "\u1004\u1032\u1032",

    u: "\u1004\u1032"
},
{
    z: "\u1005\u1033\u1033",

    u: "\u1005\u102f"
},
{
    z: "\u1005\u1033\u1033",

    u: "\u1005\u102f"
},
{
    z: "\u1005\u1034\u1034",

    u: "\u1005\u1030"
},
{
    z: "\u1006\u1036\u1036",

    u: "\u1006\u1036"
},
{
    z: "\u1007\u1037\u1037",

    u: "\u1007\u1037"
},
{
    z: "\u1009\u1039\u1039",

    u: "\u1009\u103a"
},
{
    z: "\u100a\u103a\u103a",

    u: "\u100a\u103b"
},
{
    z: "\u100b\u103b\u103b",

    u: "\u100b\u103c"
},
{
    z: "\u100d\u103d\u103d",

    u: "\u100d\u103e"
},
{
    z: "\u100e\u103e\u103e",

    u: "\u100e\u103e"
},
{
    z: "\u103b\u107f\u1080\u1081\u100f\u103b",

    u: "\u100f\u103c"
},
{
    z: "ျျမန္​မာကာမန္​မာကာ",
    u: "မြန်​မာကာမန်​မာကာ"
},
{
    z: "အခ်စ္႔႔သီေသာ pdf",
    u: "အချစ့်သီသော pdf"
},
{
    z: "တကယ္ဆို အျငိႈးေတြမဲ႔ေသာလမ္းေသာလမ္းမွာ တိုႈျပန္ဆံုျကတဲ႔အခါ ",

    u: "တကယ်ဆို အငြှိုးတွေမဲ့သောလမ်းသောလမ်းမှာ တှိုပြန်ဆုံကြတဲ့အခါ "
},
{
    z: "ျမန္္မာကို",
    u: "မြန်မာကို"
}
];

// It would be nice to use preprocessor flags here, but that would require
// building this file before Jasmine can run it.

var ZawgyiConverter;
if (typeof process !== "undefined") {
    // NodeJS
    ZawgyiConverter = require("../build_node/zawgyi_converter").ZawgyiConverter;
} else {
    // Browser
    ZawgyiConverter = window.google_myanmar_tools.ZawgyiConverter;
}

describe("ZawgyiConverter Z2U", function () {
    it("should pass the data-driven test", function () {
        const converter = new ZawgyiConverter();
        for (var i = 0; i < zawygi_unicode_convert_data.length; i++) {
            var test_case = zawygi_unicode_convert_data[i];
            var expected = test_case.u;
            var actual = converter.zawgyiToUnicode(test_case.z);
            expect(actual).toEqual(expected);
        }
    });
});

describe("ZawgyiConverter U2Z", function () {
    // TODO: Enable this test case once fixed. (change "xit" to "it")
    xit("should pass the data-driven test", function () {
        const converter = new ZawgyiConverter();
        for (var i = 0; i < zawygi_unicode_convert_data.length; i++) {
            var test_case = zawygi_unicode_convert_data[i];
            var converted = converter.unicodeToZawgyi(test_case.u);
            var expected = converter.normalizeZawgyi(test_case.z);
            var actual = converter.normalizeZawgyi(converted);
            expect(actual).toEqual(expected);
        }
    });
});
